// 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().



// const number = Number(prompt ("Введіть число:"));
//     if (number === 10) {
//         alert('Вірно');
//     }
//     else { alert('Невірно'); }
 
// 2
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

//  const min = Math.floor(Math.random() * (59 - 0) + 0);


// // let min = Number(prompt("Введіть число:"));

// while (min < 60) {
//     if (min <= 14) {
//         alert(`${min} входить в 1 чверть`);
//     }
//     else if (14 < min && min <= 29) {
//         alert(`${min} входить в 2 чверть`);
//     }
//     else if (29 < min && min <= 44) {
//         alert(`${min} входить в 3 чверть`);
//     }
//     else  {
//         alert(`${min} входить в 4 чверть`);
//     }
//    //     min = Number(prompt("Введіть число:"));
// }
// alert('Невірне число!');

// 3
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// let num = Number(prompt("Введіть число: "));
// let result = "пора року не вказана";
// switch(num) {
//     case 1:
//     result = "зима";
//     break;
//     case 2:
//     result = "весна";
//     break;
//     case 3:
//     result = "літо";
//     break;
//    case 4:
//     result = "осінь";
//      break;
//      default :
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }

// console.log(result);

// 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples



// let x = -12.75;

// console.log(Math.trunc(x));   // -12
// console.log(Math.floor(x));   // -13
// console.log(Math.round(x));   // -13
// console.log(Math.ceil(x));    // -12
// console.log(x | 0);           // -12
// console.log(~~x);             // -12
// console.log(parseInt(x));     // -12
// console.log(x - (x % 1));     // -12



// const totalTime = Number(prompt("кількість хвилин: "));

// const hours = ~~(totalTime / 60);
// const minutes = totalTime % 60;
// const result = `${String(hours).padStart(2, "0")}:${String(minutes).padStart(2, "0")}`;
// console.log(result);



// 5
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt("Введіть логін:");

// if (login === "Адмін") {
//     const password = prompt("Введіть пароль:");
//     if (password === "Я головний") {
//         alert("Добрий день!");
//     }
//     else {
//         alert("Невірний пароль!");
//     }
// }
// else if (login === "" || null) {
//     alert("Скасовано");
// }
// else {
//     alert("Я вас не знаю");
// }


// 7
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// const min = Number(prompt("Input min"));
// const max = Number(prompt("Input max"));

// function getNumbers(min, max) {
//      let sum = 0;
//     for (let i = max; i >= min; i--)  {
//         console.log(i);
        
//         if ((i % 2) === 0) {
//             sum += i;
//         }
//     }
//     return sum;
// }

// const resault = getNumbers(min, max);
// console.log(`Сума парних чисел = ${resault}`);

// 8
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

//  const a = Number(prompt("Input a"));
//  const b = Number(prompt("Input b"));

// function getMin(a, b) {
//   if (typeof a !== "number" || typeof b !== "number" || isNaN(a) || isNaN(b)) {
//     return "Not a number!";
//   }
//   return a < b ? a : b;
// }

// console.log(getMin(a, b));

